from math import factorial as fact #імпорт функії для обчислення факторіалу

x = float(input("Введіть x: "))
m = float(input("Введіть m: "))
n = int(input("Введіть точніcть 10^n: ")) # змінна степеню точності 
accur = (10**n) # змінна точності

power = 1 #змінна степеня та факторіала
count = 0  #змінна, що виступає лічильником та використовується в формулі для різниці
mult = 1 #змінна, що використовується для створення множників в чисельнику
step = 0 #змінна, в якій буде відбуватися обчислення за формулою на кожній ітерації
result = 1 #змінна, в якій буде результат кожної ітерації( за умовою відразу = 1)

while count < accur:
    mult *= (m - count)
    step = mult * pow(x, power) / fact(power)
    power += 1
    count += 1
    result += step

print(result)



